/************************************************************************
File: War_Cards
Author: Ana Pumarino
Purpose: This program creates the cards for our game.
Version: 1.0 March 12th, 2026
Resources: N/A
************************************************************************/

#include <stdio.h>

void back(void);

void dk(void);
void hk(void);
void ck(void);
void sk(void);

void dq(void);
void hq(void);
void cq(void);
void sq(void);

void dj(void);
void hj(void);
void cj(void);
void sj(void);

void d9(void);
void h9(void);
void c9(void);
void s9(void);

void d8(void);
void h8(void);
void c8(void);
void s8(void);
	
void d7(void);
void h7(void);
void c7(void);
void s7(void);

void d6(void);
void h6(void);
void c6(void);
void s6(void);

void d5(void);
void h5(void);
void c5(void);
void s5(void);

void d4(void);
void h4(void);
void c4(void);
void s4(void);

void d3(void);
void h3(void);
void c3(void);
void s3(void);

void d2(void);
void h2(void);
void c2(void);
void s2(void);

void da(void);
void ha(void);
void ca(void);
void sa(void);
void printCard(int card);
}

void printCard(int card) 
{
	int rank;
	int suit;

	rank = card % 13;
	suit = card / 13;

	if (suit == 0) {
		if (rank == 0) {
			d2();
		} else if (rank == 1) {
			d3();
		} else if (rank == 2) {
			d4();
		} else if (rank == 3) {
			d5();
		} else if (rank == 4) {
			d6();
		} else if (rank == 5) {
			d7();
		} else if (rank == 6) {
			d8();
		} else if (rank == 7) {
			d9();

		} else if (rank == 9) {
			dj();
		} else if (rank == 10) {
			dq();
		} else if (rank == 11) {
			dk();
		} else if (rank == 12) {
			da();
		}
	}
}
void back(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m# # # # # # # # #\033[0m│\n");
        printf ("│\033[0;31m# # # # # # # # #\033[0m│\n");
        printf ("│\033[0;31m# # # # # # # # #\033[0m│\n");
        printf ("│\033[0;31m# # # # # # # # #\033[0m│\n");
        printf ("│\033[0;31m+ # + # + # + # +\033[0m│\n");
        printf ("│\033[0;31m+ + + + + + + + +\033[0m│\n");
        printf ("│\033[0;31m+ + + + + + + + +\033[0m│\n");
        printf ("│\033[0;31m+ + + + + + + + +\033[0m│\n");
        printf ("│\033[0;31m- + - + - + - + -\033[0m│\n");
        printf ("│\033[0;31m- - - - - - - - -\033[0m│\n");
        printf ("│\033[0;31m- - - - - - - - -\033[0m│\n");
	printf ("│\033[0;31m- - - - - - - - -\033[0m│\n");
	printf ("│\033[0;31m. . . . . . . . .\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void dk(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mK\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31mK\033[0m        │\n");
        printf ("│       \033[0;31mK K\033[0m       │\n");
        printf ("│      \033[0;31mK   K\033[0m      │\n");
        printf ("│     \033[0;31mK     K\033[0m     │\n");
        printf ("│      \033[0;31mK   K\033[0m      │\n");
        printf ("│       \033[0;31mK K\033[0m       │\n");
        printf ("│        \033[0;31mK\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mK\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void hk(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mK\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31mK    K\033[0m     │\n");
        printf ("│     \033[0;31mK K  K K\033[0m    │\n");
        printf ("│    \033[0;31mK   K   K\033[0m    │\n");
        printf ("│     \033[0;31mK     K\033[0m     │\n");
        printf ("│      \033[0;31mK   K\033[0m      │\n");
        printf ("│       \033[0;31mK K\033[0m       │\n");
        printf ("│        \033[0;31mK\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mK\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");

}

void ck(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│K                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│       KKK       │\n");
        printf ("│     K     K     │\n");
        printf ("│    KK     KK    │\n");
        printf ("│  K           K  │\n");
        printf ("│  K    K K    K  │\n");
        printf ("│    KK  K  KK    │\n");
        printf ("│        K        │\n");
        printf ("│                 │\n");
        printf ("│                K│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void sk(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│K                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│        K        │\n");
        printf ("│       K K       │\n");
        printf ("│      K   K      │\n");
        printf ("│     K     K     │\n");
        printf ("│    K  K K  K    │\n");
        printf ("│     K  K  K     │\n");
        printf ("│        K        │\n");
        printf ("│                 │\n");
        printf ("│                K│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void dq(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mQ\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31mQ\033[0m        │\n");
        printf ("│       \033[0;31mQ Q\033[0m       │\n");
        printf ("│      \033[0;31mQ   Q\033[0m      │\n");
        printf ("│     \033[0;31mQ     Q\033[0m     │\n");
        printf ("│      \033[0;31mQ   Q\033[0m      │\n");
        printf ("│       \033[0;31mQ Q\033[0m       │\n");
        printf ("│        \033[0;31mQ\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mQ\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void hq(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mQ\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31mQ    Q\033[0m     │\n");
        printf ("│     \033[0;31mQ Q  Q Q\033[0m    │\n");
        printf ("│    \033[0;31mQ   Q   Q\033[0m    │\n");
        printf ("│     \033[0;31mQ     Q\033[0m     │\n");
        printf ("│      \033[0;31mQ   Q\033[0m      │\n");
        printf ("│       \033[0;31mQ Q\033[0m       │\n");
        printf ("│        \033[0;31mQ\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mQ\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void cq(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│Q                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│       QQQ       │\n");
        printf ("│     Q     Q     │\n");
        printf ("│    QQ     QQ    │\n");
        printf ("│  Q           Q  │\n");
        printf ("│  Q    Q Q    Q  │\n");
        printf ("│    QQ  Q  QQ    │\n");
        printf ("│        Q        │\n");
        printf ("│                 │\n");
        printf ("│                Q│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void sq(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│Q                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│        Q        │\n");
        printf ("│       Q Q       │\n");
        printf ("│      Q   Q      │\n");
        printf ("│     Q     Q     │\n");
        printf ("│    Q  Q Q  Q    │\n");
        printf ("│     Q  Q  Q     │\n");
        printf ("│        Q        │\n");
        printf ("│                 │\n");
        printf ("│                Q│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void dj(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mJ\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
	printf ("│        \033[0;31mJ\033[0m        │\n");
        printf ("│       \033[0;31mJ J\033[0m       │\n");
        printf ("│      \033[0;31mJ   J\033[0m      │\n");
        printf ("│     \033[0;31mJ     J\033[0m     │\n");
        printf ("│      \033[0;31mJ   J\033[0m      │\n");
        printf ("│       \033[0;31mJ J\033[0m       │\n");
        printf ("│        \033[0;31mJ\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mJ\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void hj(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mJ\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
	printf ("│      \033[0;31mJ    J\033[0m     │\n");
        printf ("│     \033[0;31mJ J  J J\033[0m    │\n");
        printf ("│    \033[0;31mJ   J   J\033[0m    │\n");
        printf ("│     \033[0;31mJ     J\033[0m     │\n");
        printf ("│      \033[0;31mJ   J\033[0m      │\n");
        printf ("│       \033[0;31mJ J\033[0m       │\n");
        printf ("│        \033[0;31mJ\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mJ\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void cj(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│J                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│       JJJ       │\n");
        printf ("│     J     J     │\n");
        printf ("│    JJ     JJ    │\n");
        printf ("│  J           J  │\n");
        printf ("│  J    J J    J  │\n");
        printf ("│    JJ  J  JJ    │\n");
        printf ("│        J        │\n");
        printf ("│                 │\n");
        printf ("│                J│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}
      
void sj(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│J                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│        J        │\n");
        printf ("│       J J       │\n");
        printf ("│      J   J      │\n");
        printf ("│     J     J     │\n");
        printf ("│    J  J J  J    │\n");
        printf ("│     J  J  J     │\n");
        printf ("│        J        │\n");
        printf ("│                 │\n");
        printf ("│                J│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d9(void)
{
	printf ("┌─────────────────┐\n");
	printf ("│\033[0;31m9\033[0m                │\n");
	printf ("│\033[0;31m♦\033[0m                │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
	printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
	printf ("│        \033[0;31m♦\033[0m        │\n");
	printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
	printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│                \033[0;31m9\033[0m│\n");
	printf ("│                \033[0;31m♦\033[0m│\n");
	printf ("└─────────────────┘\n");
}

void h9(void)
{
	printf ("┌─────────────────┐\n");
	printf ("│\033[0;31m9\033[0m                │\n");
	printf ("│\033[0;31m♥\033[0m                │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
	printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
	printf ("│        \033[0;31m♥\033[0m        │\n");
	printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
	printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│                \033[0;31m9\033[0m│\n");
	printf ("│                \033[0;31m♥\033[0m│\n");
	printf ("└─────────────────┘\n");
}

void c9(void)
{
	printf ("┌─────────────────┐\n");
	printf ("│9                │\n");
	printf ("│♣                │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│      ♣   ♣      │\n");
	printf ("│      ♣   ♣      │\n");
	printf ("│        ♣        │\n");
	printf ("│      ♣   ♣      │\n");
	printf ("│      ♣   ♣      │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│                9│\n");
	printf ("│                ♣│\n");
	printf ("└─────────────────┘\n");
}

void s9(void)
{
	printf ("┌─────────────────┐\n");
	printf ("│9                │\n");
	printf ("│♠                │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│      ♠   ♠      │\n");
	printf ("│      ♠   ♠      │\n");
	printf ("│        ♠        │\n");
	printf ("│      ♠   ♠      │\n");
	printf ("│      ♠   ♠      │\n");
	printf ("│                 │\n");
	printf ("│                 │\n");
	printf ("│                9│\n");
	printf ("│                ♠│\n");
	printf ("└─────────────────┘\n");
}

void d8(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m8\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m8\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h8(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m8\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m8\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c8(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│8                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│        ♣        │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│        ♣        │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                8│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s8(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│8                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│        ♠        │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│        ♠        │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                8│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d7(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m7\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
	printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
	printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
	printf ("│                 │\n");
        printf ("│                \033[0;31m7\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h7(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m7\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m7\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c7(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│7                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│        ♣        │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                7│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s7(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│7                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│        ♠        │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                7│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d6(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m6\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m6\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h6(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m6\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m6\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c6(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│6                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                6│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s6(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│6                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                6│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d5(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m5\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m5\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h5(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m5\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m5\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c5(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│5                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                5│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s5(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│5                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                5│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d4(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m4\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m4\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h4(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m4\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m4\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c4(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│4                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♣   ♣      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                4│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s4(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│4                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                4│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d3(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m3\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m3\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h3(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m3\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m3\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c3(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│3                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                3│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s3(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│3                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                3│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void d2(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m2\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m2\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void h2(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31m2\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31m2\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void c2(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│2                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                2│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void s2(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│2                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│                 │\n");
        printf ("│                2│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

void da(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mA\033[0m                │\n");
        printf ("│\033[0;31m♦\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│       \033[0;31m♦ ♦\033[0m       │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│     \033[0;31m♦     ♦\033[0m     │\n");
        printf ("│      \033[0;31m♦   ♦\033[0m      │\n");
        printf ("│       \033[0;31m♦ ♦\033[0m       │\n");
        printf ("│        \033[0;31m♦\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mA\033[0m│\n");
        printf ("│                \033[0;31m♦\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void ha(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│\033[0;31mA\033[0m                │\n");
        printf ("│\033[0;31m♥\033[0m                │\n");
        printf ("│                 │\n");
        printf ("│      \033[0;31m♥    ♥\033[0m     │\n");
        printf ("│     \033[0;31m♥ ♥  ♥ ♥\033[0m    │\n");
        printf ("│    \033[0;31m♥   ♥   ♥\033[0m    │\n");
        printf ("│     \033[0;31m♥     ♥\033[0m     │\n");
        printf ("│      \033[0;31m♥   ♥\033[0m      │\n");
        printf ("│       \033[0;31m♥ ♥\033[0m       │\n");
        printf ("│        \033[0;31m♥\033[0m        │\n");
        printf ("│                 │\n");
        printf ("│                \033[0;31mA\033[0m│\n");
        printf ("│                \033[0;31m♥\033[0m│\n");
        printf ("└─────────────────┘\n");
}

void ca(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│A                │\n");
        printf ("│♣                │\n");
        printf ("│                 │\n");
        printf ("│       ♣♣♣       │\n");
        printf ("│     ♣     ♣     │\n");
        printf ("│    ♣♣     ♣♣    │\n");
        printf ("│  ♣           ♣  │\n");
        printf ("│  ♣    ♣ ♣    ♣  │\n");
        printf ("│    ♣♣  ♣  ♣♣    │\n");
        printf ("│        ♣        │\n");
        printf ("│                 │\n");
        printf ("│                A│\n");
        printf ("│                ♣│\n");
        printf ("└─────────────────┘\n");
}

void sa(void)
{
        printf ("┌─────────────────┐\n");
        printf ("│A                │\n");
        printf ("│♠                │\n");
        printf ("│                 │\n");
        printf ("│        ♠        │\n");
        printf ("│       ♠ ♠       │\n");
        printf ("│      ♠   ♠      │\n");
        printf ("│     ♠     ♠     │\n");
        printf ("│    ♠  ♠ ♠  ♠    │\n");
        printf ("│     ♠  ♠  ♠     │\n");
        printf ("│        ♠        │\n");
        printf ("│                 │\n");
        printf ("│                A│\n");
        printf ("│                ♠│\n");
        printf ("└─────────────────┘\n");
}

